{
  "data": [
    {
      "id": 2,
      "documentId": "rts3iv7ln36owol9r20oh3fy",
      "createdAt": "2025-07-21T11:24:31.328Z",
      "updatedAt": "2025-07-21T11:24:31.328Z",
      "publishedAt": "2025-07-21T11:24:31.377Z",
      "case_studies_hero": {
        "id": 3,
        "documentId": "zep9ifdcigkhxppymk8ghmve",
        "createdAt": "2025-06-30T11:08:07.938Z",
        "updatedAt": "2025-06-30T11:55:11.143Z",
        "publishedAt": "2025-06-30T11:55:11.157Z",
        "title": "Case Studies",
        "description": "Discover how our technology solutions have propelled businesses to new heights. Through collaboration, innovation, and a tailored approach, we’ve helped our clients overcome complex challenges, streamline operations, and unlock new opportunities for growth.",
        "image": {
          "id": 39,
          "documentId": "t7x8840qq38ibi3d5efwheno",
          "name": "case-studies-bg.jpg",
          "alternativeText": null,
          "caption": null,
          "width": 5184,
          "height": 3456,
          "formats": {
            "thumbnail": {
              "name": "thumbnail_case-studies-bg.jpg",
              "hash": "thumbnail_case_studies_bg_cfe0184754",
              "ext": ".jpg",
              "mime": "image/jpeg",
              "path": null,
              "width": 234,
              "height": 156,
              "size": 5.55,
              "sizeInBytes": 5546,
              "url": "/uploads/thumbnail_case_studies_bg_cfe0184754.jpg"
            },
            "large": {
              "name": "large_case-studies-bg.jpg",
              "hash": "large_case_studies_bg_cfe0184754",
              "ext": ".jpg",
              "mime": "image/jpeg",
              "path": null,
              "width": 1000,
              "height": 667,
              "size": 41.55,
              "sizeInBytes": 41545,
              "url": "/uploads/large_case_studies_bg_cfe0184754.jpg"
            },
            "medium": {
              "name": "medium_case-studies-bg.jpg",
              "hash": "medium_case_studies_bg_cfe0184754",
              "ext": ".jpg",
              "mime": "image/jpeg",
              "path": null,
              "width": 750,
              "height": 500,
              "size": 27.95,
              "sizeInBytes": 27954,
              "url": "/uploads/medium_case_studies_bg_cfe0184754.jpg"
            },
            "small": {
              "name": "small_case-studies-bg.jpg",
              "hash": "small_case_studies_bg_cfe0184754",
              "ext": ".jpg",
              "mime": "image/jpeg",
              "path": null,
              "width": 500,
              "height": 333,
              "size": 15.8,
              "sizeInBytes": 15801,
              "url": "/uploads/small_case_studies_bg_cfe0184754.jpg"
            }
          },
          "hash": "case_studies_bg_cfe0184754",
          "ext": ".jpg",
          "mime": "image/jpeg",
          "size": 448,
          "url": "/uploads/case_studies_bg_cfe0184754.jpg",
          "previewUrl": null,
          "provider": "local",
          "provider_metadata": null,
          "createdAt": "2025-06-30T11:07:14.386Z",
          "updatedAt": "2025-07-01T08:56:01.518Z",
          "publishedAt": "2025-06-30T11:07:14.387Z"
        },
        "Button": {
          "id": 18,
          "title": "Get Started",
          "url": "contact"
        }
      },
      "case_study_cards": [
        {
          "id": 158,
          "documentId": "tvrwhikn9qq81rgvjvsill8c",
          "title": "Building a Cloud-Based BI System",
          "description": "We created a roaming analytics solution with the most comprehensive features in the market for Yaana, a worldwide provider of smart compliance and national security solutions.",
          "createdAt": "2025-07-04T13:18:23.682Z",
          "updatedAt": "2025-08-26T11:54:34.424Z",
          "publishedAt": "2025-08-26T11:54:34.453Z",
          "slug": "building-a-cloud-based-bi-system-1",
          "region": "UK",
          "technologies": "Microsoft Orleans Docker Azure Terraform",
          "caseStudyStatus": "Ongoing",
          "aboutClient": "SaaS for hotels",
          "order": 3,
          "showOnTop": false,
          "category": "Hospitality",
          "content": "Yaana Technologies had the possibility to become a leader in the European market, but their newly acquired legacy system didn't let the company meet its ambitious goal. The desktop solution had some important limitations that prevented the company’s growth. For example, it was impossible to create deals, compare several budgets or work in parallel. Rigid architecture and the lack of functionality blocked Yaana from attracting global clients such as Orange Group, a multinational telecom corporation.\n\n## The Challenge\n\nThe client was facing issues with a traditional monolithic CMS.  \nContent updates were slow, scaling required heavy infrastructure investment, and the frontend performance was not meeting user expectations.  \nThey needed a modern stack that could handle dynamic product updates while delivering a fast and engaging shopping experience.\n\nTo acquire the world’s leading enterprises, Yaana needed to switch from the desktop NeuString system to a web-based solution and enhance the existing functionality specifically for mobile operator groups. To achieve it, they reached out to Flyaps. \n\n## Exceptional calculation skills and focus on UX\n\n\nTo build telecom solutions – or any tech-driven products – you need two things: implementing the features that fully respond to the clients’ needs and creating an interface that would deliver a seamless experience. At Flyaps, we do both: with a focus on user-centered interfaces and advanced functionality, we are able to implement the most complex algorithms and wrap them in a sleek design that even non-tech users can understand.\n\n![Team Working](https://images.unsplash.com/photo-1667372283536-a832e74401c2?q=80&w=1632&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D)\n\n---\n\n## Seamless transition to a new system\n\nEntirely replacing the legacy system means that all business processes will be disrupted. For the existing clients, it translates into inconveniences and delays that would impact their workflows. That’s why we suggested the evolutionary approach – instead of instantly switching off the old system, we decided to keep it while building a new solution and enabling access to both systems. Gradually replacing an old system with a new one, we avoided radical changes and disrupting the ongoing processes.\n",
          "image": {
            "id": 151,
            "documentId": "okvsuef15x11ah8qa8641mpt",
            "url": "/uploads/thumbnail_case_studies_3f5653d8aa_a8d78d8737.jpg",
            "formats": {
              "thumbnail": {
                "name": "thumbnail_thumbnail_case_studies_3f5653d8aa.jpg",
                "hash": "thumbnail_thumbnail_case_studies_3f5653d8aa_a8d78d8737",
                "ext": ".jpg",
                "mime": "image/jpeg",
                "path": null,
                "width": 245,
                "height": 138,
                "size": 6.53,
                "sizeInBytes": 6534,
                "url": "/uploads/thumbnail_thumbnail_case_studies_3f5653d8aa_a8d78d8737.jpg"
              },
              "small": {
                "name": "small_thumbnail_case_studies_3f5653d8aa.jpg",
                "hash": "small_thumbnail_case_studies_3f5653d8aa_a8d78d8737",
                "ext": ".jpg",
                "mime": "image/jpeg",
                "path": null,
                "width": 500,
                "height": 281,
                "size": 19.72,
                "sizeInBytes": 19719,
                "url": "/uploads/small_thumbnail_case_studies_3f5653d8aa_a8d78d8737.jpg"
              },
              "medium": {
                "name": "medium_thumbnail_case_studies_3f5653d8aa.jpg",
                "hash": "medium_thumbnail_case_studies_3f5653d8aa_a8d78d8737",
                "ext": ".jpg",
                "mime": "image/jpeg",
                "path": null,
                "width": 750,
                "height": 422,
                "size": 34.6,
                "sizeInBytes": 34605,
                "url": "/uploads/medium_thumbnail_case_studies_3f5653d8aa_a8d78d8737.jpg"
              }
            }
          }
        },
        {
          "id": 167,
          "documentId": "w7zh6bze84a2qrcqml49y6vk",
          "title": "Automating Business Processes to Speed Up Project Delivery",
          "description": "Smach Stack created a custom CRM/ERP solution for a leading telecom consulting firm. Automating their back-office processes and streamlining calculations for suitable tariff plans for clients.",
          "createdAt": "2025-07-16T08:19:27.644Z",
          "updatedAt": "2025-08-26T13:25:56.497Z",
          "publishedAt": "2025-08-26T13:25:56.543Z",
          "slug": "development-of-hybrid-events-software",
          "region": "Germany",
          "technologies": "Angular, Vue.js, Svelte",
          "caseStudyStatus": "Delivered",
          "aboutClient": "meta-fusion GmbH",
          "order": 1,
          "showOnTop": false,
          "category": "Entertainment",
          "content": "\nNetSpark IP & Telecom provides two types of services – wireline engagement and mobility engagement. \nWireline engagement involves configuring network equipment and IT infrastructure for various organizations. For instance, they may enhance mobile network coverage in metro stations or install GPS tracking systems for delivery companies.\n\n## We know telecom, so we fit the bill\nOur team has significant experience in the telecom industry and understands the specific details of tariff plans, including discounts, special offers, and more. We know that accuracy is crucial in this field. NetSpark was seeking a partner with these qualities, and we were the perfect fit.\n\n![Team Working](https://images.unsplash.com/photo-1669023414162-5bb06bbff0ec?q=80&w=1632&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D)\n\n## Collaborative business process mapping\nDuring the discovery phase, we collaborated with the leaders of various company departments to perform business process mapping and create tech specifications. We analyzed the client’s business requirements and converted them into technical tasks for our engineers. Once the technical documentation was ready, we got down to software development.\n\n## Developing custom CRM/ERP software\nSince our client didn’t have in-house technical experts, the software development process was entirely on us. We used Python (Django), React, and Material UI for fast and cost-effective product development. Our DevOps engineer set up CI/CD pipelines to automate the release process so that we could deliver high-quality builds frequently.\n",
          "image": {
            "id": 171,
            "documentId": "fc6v16qvapnw62rgo58t9ztg",
            "url": "/uploads/last_case_study_6929d5eead.jpg",
            "formats": {
              "thumbnail": {
                "name": "thumbnail_last-case-study.jpg",
                "hash": "thumbnail_last_case_study_6929d5eead",
                "ext": ".jpg",
                "mime": "image/jpeg",
                "path": null,
                "width": 245,
                "height": 140,
                "size": 82.86,
                "sizeInBytes": 82863,
                "url": "/uploads/thumbnail_last_case_study_6929d5eead.jpg"
              },
              "small": {
                "name": "small_last-case-study.jpg",
                "hash": "small_last_case_study_6929d5eead",
                "ext": ".jpg",
                "mime": "image/jpeg",
                "path": null,
                "width": 500,
                "height": 286,
                "size": 313.91,
                "sizeInBytes": 313907,
                "url": "/uploads/small_last_case_study_6929d5eead.jpg"
              },
              "medium": {
                "name": "medium_last-case-study.jpg",
                "hash": "medium_last_case_study_6929d5eead",
                "ext": ".jpg",
                "mime": "image/jpeg",
                "path": null,
                "width": 750,
                "height": 429,
                "size": 680.17,
                "sizeInBytes": 680170,
                "url": "/uploads/medium_last_case_study_6929d5eead.jpg"
              },
              "large": {
                "name": "large_last-case-study.jpg",
                "hash": "large_last_case_study_6929d5eead",
                "ext": ".jpg",
                "mime": "image/jpeg",
                "path": null,
                "width": 1000,
                "height": 571,
                "size": 1184.29,
                "sizeInBytes": 1184291,
                "url": "/uploads/large_last_case_study_6929d5eead.jpg"
              }
            }
          }
        },
        {
          "id": 168,
          "documentId": "cwlodzy0171l1cte8rtrjm0s",
          "title": "Setting Up DevOps Infrastructure on AWS",
          "description": "Global talent-matching platform, faced scalability issues due to its outdated infrastructure and turned to Smach Stack for help. We moved their system from a legacy setup to a modern, scalable platform powered by Kubernetes on AWS.",
          "createdAt": "2025-07-13T21:35:32.996Z",
          "updatedAt": "2025-08-26T13:26:41.959Z",
          "publishedAt": "2025-08-26T13:26:41.981Z",
          "slug": "software-outsourcing-company",
          "region": "Pakistan",
          "technologies": "Azure",
          "caseStudyStatus": "Ongoing",
          "aboutClient": null,
          "order": 6,
          "showOnTop": false,
          "category": "Automotive",
          "content": "TechHire is a leading talent-matching platform that connects employers with over 50,000 vetted candidates from 500+ top agencies in Latin America and Europe. Founded in 2014, TechHire quickly became a global hit and surpassed $1 million in sales within two years without any external investment. It was shortly accepted by a well-known American venture fund for promising startups.\n\nThe secret behind TechHire’s success is that it offers a safe and stress-free solution to the common problem of team scaling. Here’s how it works: the TechHire platform features developer profiles from the software development agencies that passed TechHire's multistep vetting process. Clients set up a quick call with one of the Matching Experts at TechHire, build a candidate list, and conduct pre-interviews to ensure the candidates perfectly fit their needs. Finally, they sign a contract with the chosen talent. TechHire provides a 1-month free trial and candidate replacements if needed.\n\nAs their customer base grew, TechHire faced the scalability problem. Their legacy platform's internal issues prevented it from scaling, impacting performance, time to market, and deployment speed. To solve this problem, TechHire reached out to CodeWorks for ongoing support and DevOps services.\n\nRead on to learn how we overhauled the platform’s architecture and allowed TechHire to evolve their platform further, taking full control of their solution.\n\n## The need for a complete infrastructure overhaul\n\nBefore starting the project, our team conducted a thorough DevOps assessment to identify the root cause of the problem and come up with the best strategy to tackle it. We discovered that the key issue was the chaotic infrastructure that had already reached a dead-end level and started to tamper with the development pace and time-to-market.\n\nAnother key problem was that the platform was at constant risk of data loss, as there was no backup storage or plan B in case of a system crash.",
          "image": {
            "id": 169,
            "documentId": "yqfb39kmf6vv9c3dtuzwdj9t",
            "url": "/uploads/img24_1af3604f78.jpg",
            "formats": {
              "thumbnail": {
                "name": "thumbnail_img24.jpg",
                "hash": "thumbnail_img24_1af3604f78",
                "ext": ".jpg",
                "mime": "image/jpeg",
                "path": null,
                "width": 245,
                "height": 138,
                "size": 7.25,
                "sizeInBytes": 7250,
                "url": "/uploads/thumbnail_img24_1af3604f78.jpg"
              },
              "medium": {
                "name": "medium_img24.jpg",
                "hash": "medium_img24_1af3604f78",
                "ext": ".jpg",
                "mime": "image/jpeg",
                "path": null,
                "width": 750,
                "height": 422,
                "size": 39.13,
                "sizeInBytes": 39133,
                "url": "/uploads/medium_img24_1af3604f78.jpg"
              },
              "small": {
                "name": "small_img24.jpg",
                "hash": "small_img24_1af3604f78",
                "ext": ".jpg",
                "mime": "image/jpeg",
                "path": null,
                "width": 500,
                "height": 281,
                "size": 21.76,
                "sizeInBytes": 21756,
                "url": "/uploads/small_img24_1af3604f78.jpg"
              }
            }
          }
        },
        {
          "id": 165,
          "documentId": "ks6x6j35wzmzt1wle9qfohwe",
          "title": "Developing an AI-based Resume Screening Chrome Extension",
          "description": "We helped an HR technology startup create a smart plugin that optimizes the process of resume screening.",
          "createdAt": "2025-08-26T12:49:13.888Z",
          "updatedAt": "2025-08-26T12:49:13.888Z",
          "publishedAt": "2025-08-26T12:49:13.900Z",
          "slug": "developing-an-ai-based-resume-screening-chrome-extension",
          "region": "Pakistan",
          "technologies": "React Js, Prisma, Nest Js",
          "caseStudyStatus": "Delivered",
          "aboutClient": null,
          "order": 5,
          "showOnTop": false,
          "category": "Artificial Intelligence",
          "content": "## Project highlights\n\nBuilt an AI-based Chrome extension that analyzes resumes and provides definitions of IT terms\n\nImplemented a natural language processing algorithm to correctly extract critical data\n\nCreated our own tokenizer to speed up the analysis and enhance the accuracy\n\n## Chrome extension to automatically analyze and evaluate candidate CVs\n\nThe IT industry is developing at an insane pace. EJB, JSF, JPA, JBoss – new libraries and tools emerge every month, creating new tech terms. This makes candidate screening a complicated process – even for experienced recruiters, it becomes more and more difficult to keep all the technical terms in mind.\n\nThis is why GlossaryTech was built – the extension is designed to help recruitment managers with the resume screening process. Within seconds of analyzing a web page, this tool automatically sorts the technologies mentioned by a developer, highlights them in the resume, and provides their definitions. This significantly simplifies and speeds up the process for recruiters to evaluate whether a candidate is suitable for the role.\n\n## Implementing an NLP algorithm to correctly extract critical data\n\nThe main challenge in automatic text analysis is developing an algorithm capable of extracting crucial data and accurately interpreting it. Algorithms may miss important information because of unstructured documents and variations in meaning. With tech terms, the data analysis becomes even harder – for example, how do you define if the word \"go\" used in a developer's resume is a verb or a programming language?\n\nTo tackle these challenges, we developed an NLP algorithm that uses our tech glossary as a reference to precisely comprehend the meaning and context of language. By relying on machine learning, NLP can quickly identify the necessary information and categorize it correctly, thus expediting the resume screening process.\n\n## Building our own tokenizer for faster analysis of multi-word expressions\n\nAlthough open-source libraries can work great in certain cases, they don’t allow full control over the analyzing process. To make GlossaryTech faster and more accurate in terms of data extraction, we decided to build our own tokenizer.\n\nThis tokenizer is designed for general purpose and works perfectly for the ICT domain. It is optimized for identifying particular entities or phrases, and it performs well not only with single words but also with multi-word phrases, such as \"Ruby on Rails\".",
          "image": {
            "id": 196,
            "documentId": "lr0sbnjwulacqgsme7zw49bn",
            "url": "/uploads/glossary_tech_case_1x_aad578c2c58c_37b04055d0.png",
            "formats": {
              "thumbnail": {
                "name": "thumbnail_glossary-tech-case@1x.aad578c2c58c.png",
                "hash": "thumbnail_glossary_tech_case_1x_aad578c2c58c_37b04055d0",
                "ext": ".png",
                "mime": "image/png",
                "path": null,
                "width": 191,
                "height": 156,
                "size": 29.58,
                "sizeInBytes": 29579,
                "url": "/uploads/thumbnail_glossary_tech_case_1x_aad578c2c58c_37b04055d0.png"
              },
              "small": {
                "name": "small_glossary-tech-case@1x.aad578c2c58c.png",
                "hash": "small_glossary_tech_case_1x_aad578c2c58c_37b04055d0",
                "ext": ".png",
                "mime": "image/png",
                "path": null,
                "width": 500,
                "height": 408,
                "size": 127.85,
                "sizeInBytes": 127846,
                "url": "/uploads/small_glossary_tech_case_1x_aad578c2c58c_37b04055d0.png"
              }
            }
          }
        }
      ],
      "contact_section": {
        "id": 6,
        "documentId": "oufmpfk024nj9mtlu6me5t8i",
        "createdAt": "2025-05-28T11:33:42.635Z",
        "updatedAt": "2025-07-25T10:15:45.668Z",
        "publishedAt": "2025-07-25T10:15:45.688Z",
        "title": "Let’s Build Your Digital Success Story",
        "description": "With decades of expertise and hundreds of future-ready solutions delivered globally, Smach Stack combines technical mastery and industry insights to turn complex challenges into growth. Partner with a team trusted by enterprises worldwide—where technology meets innovation.",
        "contactForm": {
          "id": 6,
          "Input": [
            {
              "id": 41,
              "label": "First Name"
            },
            {
              "id": 42,
              "label": "Last Name"
            },
            {
              "id": 43,
              "label": "Email Address"
            },
            {
              "id": 44,
              "label": "Company Name"
            },
            {
              "id": 45,
              "label": "Country"
            },
            {
              "id": 46,
              "label": "How did you hear about us?"
            },
            {
              "id": 47,
              "label": "Which service interests you?"
            },
            {
              "id": 48,
              "label": "How can we help?"
            }
          ],
          "inputOptions": [
            {
              "id": 26,
              "label": "Advertisement",
              "value": "Ads"
            },
            {
              "id": 27,
              "label": "Search Engine",
              "value": "SE"
            },
            {
              "id": 28,
              "label": "Social Media",
              "value": "SM"
            },
            {
              "id": 29,
              "label": "Email Marketing",
              "value": "EM"
            },
            {
              "id": 30,
              "label": "Other",
              "value": "Ot"
            }
          ],
          "serviceTitles": [
            {
              "id": 31,
              "title": "AI & ML Development"
            },
            {
              "id": 32,
              "title": "Cloud Engineering"
            },
            {
              "id": 33,
              "title": "Data Analytics."
            },
            {
              "id": 34,
              "title": "Web Development"
            },
            {
              "id": 35,
              "title": "Mobile App Development"
            },
            {
              "id": 36,
              "title": "ISO Certification"
            }
          ]
        },
        "footerSteps": {
          "id": 6,
          "firstStep": "An expert contacts you after having analyzed your requirements",
          "secondStep": "If needed, we sign an NDA to ensure the highest privacy level",
          "thirdStep": "We submit a comprehensive project proposal with estimates, timelines, CVs, etc."
        }
      }
    }
  ],
  "meta": {
    "pagination": {
      "page": 1,
      "pageSize": 25,
      "pageCount": 1,
      "total": 1
    }
  }
}